espressif/arduino-esp32/libraries/WiFi/src/WiFiGeneric.cpp
    return true;
}

// -----------------------------------------------------------------------------------------------------------------------
// ------------------------------------------------ Generic Network function ---------------------------------------------
// -----------------------------------------------------------------------------------------------------------------------

typedef struct gethostbynameParameters {
    const char *hostname;
    ip_addr_t addr;
    uint8_t addr_type;
    int result;
} gethostbynameParameters_t;

/**
 * DNS callback
 * @param name
 * @param ipaddr
 * @param callback_arg
 */
static void wifi_dns_found_callback(const char *name, const ip_addr_t *ipaddr, void *callback_arg)
{
    gethostbynameParameters_t *parameters = static_cast<gethostbynameParameters_t *>(callback_arg);
    if(ipaddr) {
        if(parameters->result == 0){
            memcpy(&(parameters->addr), ipaddr, sizeof(ip_addr_t));
            parameters->result = 1;
        }
    } else {
        parameters->result = -1;
    }
    xEventGroupSetBits(_arduino_event_group, NET_DNS_DONE_BIT);
}

/**
 * Callback to execute dns_gethostbyname in lwIP's TCP/IP context
 * @param param Parameters for dns_gethostbyname call
 */
static esp_err_t wifi_gethostbyname_tcpip_ctx(void *param)
{
    gethostbynameParameters_t *parameters = static_cast<gethostbynameParameters_t *>(param);
    return dns_gethostbyname_addrtype(parameters->hostname, &parameters->addr, &wifi_dns_found_callback, parameters, parameters->addr_type);
}

/**
 * Resolve the given hostname to an IP address.
 * @param aHostname     Name to be resolved
 * @param aResult       IPAddress structure to store the returned IP address
 * @return 1 if aIPAddrString was successfully converted to an IP address,
 *          else error code
 */
int WiFiGenericClass::hostByName(const char* aHostname, IPAddress& aResult, bool preferV6)
{
    err_t err = ERR_OK;
    gethostbynameParameters_t params;

    // This should generally check if we have a global address assigned to one of the interfaces.
    // If such address is not assigned, there is no point in trying to get V6 from DNS as we will not be able to reach it.
    // That is of course, if 'preferV6' is not set to true
    static bool hasGlobalV6 = false;
    bool hasGlobalV6Now = (getStatusBits() & NET_HAS_IP6_GLOBAL_BIT) != 0;
    if(hasGlobalV6 != hasGlobalV6Now){
        hasGlobalV6 = hasGlobalV6Now;
        dns_clear_cache();
        log_d("Clearing DNS cache");
    }

    aResult = static_cast<uint32_t>(0);
    params.hostname = aHostname;
    params.addr_type = (preferV6 || hasGlobalV6)?LWIP_DNS_ADDRTYPE_IPV6_IPV4:LWIP_DNS_ADDRTYPE_IPV4;
    params.result = 0;
    aResult.to_ip_addr_t(&(params.addr));

    if (!aResult.fromString(aHostname)) {
        waitStatusBits(NET_DNS_IDLE_BIT, 16000);
        clearStatusBits(NET_DNS_IDLE_BIT | NET_DNS_DONE_BIT);

        err = esp_netif_tcpip_exec(wifi_gethostbyname_tcpip_ctx, &params);
        if (err == ERR_OK) {
            aResult.from_ip_addr_t(&(params.addr));
        } else if (err == ERR_INPROGRESS) {
            waitStatusBits(NET_DNS_DONE_BIT, 15000);  //real internal timeout in lwip library is 14[s]
            clearStatusBits(NET_DNS_DONE_BIT);
            if (params.result == 1) {
                aResult.from_ip_addr_t(&(params.addr));
                err = ERR_OK;
            }
        }
        setStatusBits(NET_DNS_IDLE_BIT);
    }
    if (err == ERR_OK) {
        return 1;
    }
    log_e("DNS Failed for '%s' with error '%d' and result '%d'", aHostname, err, params.result);
    return err;
}

/*
 * Deprecated Methods
*/
// int WiFiGenericClass::hostByName(const char* aHostname, IPAddress& aResult)
// {
//     return Network.hostByName(aHostname, aResult);
// }

IPAddress WiFiGenericClass::calculateNetworkID(IPAddress ip, IPAddress subnet) {
    IPAddress networkID;

    for (size_t i = 0; i < 4; i++)
        networkID[i] = subnet[i] & ip[i];

    return networkID;
}

IPAddress WiFiGenericClass::calculateBroadcast(IPAddress ip, IPAddress subnet) {
    IPAddress broadcastIp;
    
    for (int i = 0; i < 4; i++)
        broadcastIp[i] = ~subnet[i] | ip[i];

    return broadcastIp;
}

uint8_t WiFiGenericClass::calculateSubnetCIDR(IPAddress subnetMask) {
    uint8_t CIDR = 0;

    for (uint8_t i = 0; i < 4; i++) {
        if (subnetMask[i] == 0x80)  // 128
            CIDR += 1;
        else if (subnetMask[i] == 0xC0)  // 192
            CIDR += 2;
        else if (subnetMask[i] == 0xE0)  // 224
            CIDR += 3;
        else if (subnetMask[i] == 0xF0)  // 242
            CIDR += 4;
        else if (subnetMask[i] == 0xF8)  // 248
            CIDR += 5;
        else if (subnetMask[i] == 0xFC)  // 252
            CIDR += 6;
        else if (subnetMask[i] == 0xFE)  // 254
            CIDR += 7;
        else if (subnetMask[i] == 0xFF)  // 255
            CIDR += 8;
    }

    return CIDR;
}

wifi_event_id_t WiFiGenericClass::onEvent(WiFiEventCb cbEvent, arduino_event_id_t event)
{
    return Network.onEvent(cbEvent, event);
}

wifi_event_id_t WiFiGenericClass::onEvent(WiFiEventFuncCb cbEvent, arduino_event_id_t event)
{
    return Network.onEvent(cbEvent, event);
}

wifi_event_id_t WiFiGenericClass::onEvent(WiFiEventSysCb cbEvent, arduino_event_id_t event)
{
    return Network.onEvent(cbEvent, event);
}

void WiFiGenericClass::removeEvent(WiFiEventCb cbEvent, arduino_event_id_t event)
{
    Network.removeEvent(cbEvent, event);
}

void WiFiGenericClass::removeEvent(WiFiEventSysCb cbEvent, arduino_event_id_t event)
{
    Network.removeEvent(cbEvent, event);
}

void WiFiGenericClass::removeEvent(wifi_event_id_t id)
{
    Network.removeEvent(id);
}

int WiFiGenericClass::setStatusBits(int bits){
    return Network.setStatusBits(bits);
}

int WiFiGenericClass::clearStatusBits(int bits){
    return Network.clearStatusBits(bits);
}

int WiFiGenericClass::getStatusBits(){
    return Network.getStatusBits();
}

int WiFiGenericClass::waitStatusBits(int bits, uint32_t timeout_ms){
    return Network.waitStatusBits(bits, timeout_ms);
}

#endif /* SOC_WIFI_SUPPORTED */
